/**
 * Змінні та типи даних
 *
 * - Оголошення змінних з let и const
 * - Перевизначення значення
 * - Найменування змінних
 * - Вибір між const і let
 * - Числа, рядки, булі, null, undefined
 * - Оператор typeof
 */

//!=========================================

//!=========================================
// const firstName = 'Vasya';
// const isValidPassord = true;
// console.log(firstname);

//!=========================================

// const x = 25;
// const y = 55;

// console.log(x + y);

//!=========================================

// let x = 25;
// x = 90;
// console.log(x);

//!=========================================

// const balance = 25;
// balance = 0;

//!=========================================

// let firstname = 'Vasya';
// const lastname = 'Ivanenko';

//!=========================================

// let balance = 100;
// balance = 500;

//!=========================================

// string - 'awdawdawdawdawdawdad'
// number - 25 12 44
// boolean - true false

// null
// undefined

//!=========================================

// let x;
// x = 25;
// x = 30;
// x = null;
// console.log(x);

//!=========================================
