/**
 * Об'єкти
 *
 * - Тип даних за посиланням
 * - Масиви і функції - це об'єкти
 */

//!=========================================

// const a = { x1: 10, x2: 20, x3: 30 };
// const b = { x1: 10, x2: 20, x3: 30 };

// console.log(a === b);

//!=========================================

// const a = { x1: 10, x2: 20, x3: 30 };

// const b = a;

// b.x1 = 100;

// console.log(a);
// console.log(b);

//!=========================================

// const arr = [1, 2, 3, 4, 5, 5];

// arr.test = 'Hello world';

// console.log(arr.test);

//!=========================================
// function foo() {}

// const copy = foo;

// copy()

//!=========================================

// const a = [1, 3, 5, 7, 8, 2, 1, 2];
