/**
 * Передача за посиланням і за значенням
 *
 * Примітиви і складні типи
 * Посилальна рівність (referential equality)
 */

// const a = ['Vasya', 'Kolya', 'Petro'];
// const b = a;

// console.log(a === b);

//!=========================================

// const a = [1, 2, 3];
// const b = [1, 2, 3];

// console.log(a === b);

//!=========================================

// let x = 10;

// const arr = [1, 2, 3];

// arr[0] = x;

// x = 25;

// console.log(arr);

//!=========================================

// let x = 10;
// let y = 25;
// y = x;
// x = 50;

//!=========================================
