console.log(x);

const x = 10;

//!=========================================
/*
1. Напиши функцію яка приймає масив рядочків. Потрібно змінити кожен елемент
   масиву наступним чином - якщо довжина рядочку менша за 6 до привести рядок до
   нижнього регістру, в іншому випадку привести до верхнього регістру. 
   */

// ['hello', 'test', 'test message', 'world']

// function task1(array) {
//   for (let i = 0; i < array.length; i++) {
//     if (array[i].length < 6) {
//       array[i] = array[i].toLowerCase();
//     } else {
//       array[i] = array[i].toUpperCase();
//     }
//   }

//   return array;
// }

// const res = task1(['hello', 'test', 'test message', 'world']);
// console.log(res);

//!=========================================
/* 
2. Напиши функцію, яка приймає довільну кількість чисел і повертає новий масив, що містить
   лише непарні числа. 
   */

// function task2() {
//   const items = Array.from(arguments);
//   const res = [];

//   for (const item of items) {
//     if (item % 2 !== 0) {
//       res.push(item);
//     }
//   }

//   return res;
// }

//!=========================================
/* 
3. Напиши функцію, яка приймає довільну кількість чисел і повертає новий масив, де кожне
   число помножене на індекс, за яким воно знаходиться в масиві. */
// [5,1,2,4,5,6];
// [0,1,4,12, 20, 30]

function task3() {
  const items = Array.from(arguments);
  const res = [];

  for (let i = 0; i < items.length; i++) {
    res.push(items[i] * i);
  }

  return res;
}
//!=========================================
/* 
4. Напиши функцію, яка приймає довільну кількість чисел і повертає новий масив, що містить
   лише числа, які діляться на 3.
 */
